app/views/pages/agency.html.haml

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 3]]
---
      .container
        / Brand and toggle get grouped for better mobile display
        .navbar-header.page-scroll