app/views/pages/creative.html.haml

            %span.icon-bar
          %a.navbar-brand.page-scroll{:href => "#page-top"} Start Bootstrap
---
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 2]]