app/views/pages/grayscale.html.haml

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 5]]
---
            %i.fa.fa-bars
          %a.navbar-brand.page-scroll{:href => "#page-top"}