app/views/admin/products/_product.html.haml

SELECT  "photos".* FROM "photos" WHERE "photos"."product_id" = ? LIMIT 1  [["product_id", 1]]
---
.col-xs-6.col-md-3.text-center
  - if product.photo.present?