app/controllers/products_controller.rb

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    render "pages/#{@product.page.folder_name}.html.haml", layout: false