app/views/admin/users/index.html.haml

      %td= user.admin? ? '管理者' : '一般使用者'
      - if User.where(is_admin: true).all.size > 1
---
SELECT COUNT(*) FROM "users" WHERE "users"."is_admin" = ?  [["is_admin", "t"]]