app/views/products/index.html.haml

SELECT  "photos".* FROM "photos" WHERE "photos"."product_id" = ? LIMIT 1  [["product_id", 1]]
---
      = link_to product_path(product), data: { 'no_turbolink': true } do
        - if product.photo.present?